УНФ_ТЕСТ.BizOn_WMS_MES/src/Documents/БЗ_ШаблонТехнологическогоПроцесса/БЗ_ШаблонТехнологическогоПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БЗ_ШаблонТехнологическогоПроцесса</name>
  <attributes>
    <name>ДатаВступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаПроизводство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПартии</name>
    <type>
      <types>CatalogRef.БЗ_ВидыПартииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыходныеИзделия</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерX</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерY</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерZ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипИзделия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидФасада</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сборка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Хрупкое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПоддона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппаТорговля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>ОперацияНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОперацияНомерСледующий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.БЗ_ТехнологическиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Участок</name>
      <type>
        <types>CatalogRef.БЗ_Участки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантНаладки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МожноПропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазоваяЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ.BizOn_WMS_MES/src/Documents/БЗ_ШаблонТехнологическогоПроцесса/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Перем Заголовок;
	// Вставить содержимое обработчика.
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("ДатаВступления, НоменклатурнаяГруппаПроизводство, Подразделение, Ответственный");

	// Вызовем общую процедуру для проверки проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ИмяТабличнойЧасти = "Операции";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("ОперацияНомер, Операция, Участок, Количество, БазоваяЕдиницаИзмерения");

	// Вызовем общую процедуру для проверки проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	//Для идентификации шаблонов технлогических процессов по Номенклатуре или ном. группе
	ПровестиПоРегиструШаблоныТехнологическихПроцессов(Отказ);   
	
	Движения.Записать();	
КонецПроцедуры

Процедура ПровестиПоРегиструШаблоныТехнологическихПроцессов(Отказ)
	НаборДвижений = Движения.БЗ_ШаблоныТехнологическихПроцессов;
	НаборДвижений.Записывать = Истина;
	НаборДвижений.Очистить();
	
	Если ВыходныеИзделия.Количество() = 0 Тогда
		Движение = НаборДвижений.Добавить();
		Движение.Регистратор = Ссылка;
		Движение.НоменклатурнаяГруппаПроизводство = НоменклатурнаяГруппаПроизводство;
		Движение.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		Движение.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Движение.ШаблонТехнологическогоПроцесса = Ссылка;
		Движение.Активность = Истина;
		Движение.Период = ДатаВступления; // из шапки
		Движение.ВидПартии = ВидПартии;
	Иначе
		Для Каждого СтрокаВыхИзд из ВыходныеИзделия Цикл
			Движение = НаборДвижений.Добавить();
			Движение.Регистратор = Ссылка;
			Движение.НоменклатурнаяГруппаПроизводство = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
			Движение.Номенклатура = СтрокаВыхИзд.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = СтрокаВыхИзд.ХарактеристикаНоменклатуры;
			Движение.ШаблонТехнологическогоПроцесса = Ссылка;
			Движение.Активность = Истина;
			Движение.Период = ДатаВступления; // из шапки
			Движение.ВидПартии = ВидПартии;
		КонецЦикла
	КонецЕсли;
	
	
	// Если Режим - На номенклатуру
	
	//// В одном документе не может быть 2 строки с одинаковой номенклатурой и характеристикой. Это вызовет исключение при записи в регистр.
	//Для Каждого текПродукция из Продукция Цикл
	//	Движение = НаборДвижений.Добавить();
	//	Движение.Регистратор = Ссылка;
	//	Движение.Номенклатура = текПродукция.Номенклатура;
	//	Движение.ХарактеристикаНоменклатуры = текПродукция.ХарактеристикаНоменклатуры;
	//	Движение.КлючСтроки = текПродукция.КлючСтроки;
	//	Движение.ШаблонТехнологическогоПроцесса = Ссылка;
	//	Движение.Активность = Истина;
	//	Движение.Период = ДатаВступления; // из шапки
	//КонецЦикла;
	
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.    
	ДатаВступления = НачалоДня(ТекущаяДата());
	#Если Клиент Или ВнешнееСоединение Тогда
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), , , ОбъектКопирования, ОбъектКопирования);
	#КонецЕсли
	Комментарий = "";
КонецПроцедуры
